%:define ⲟᴏοⲟ(ᴏоοօ)ᴏоοօ(οօᴏ)ᴏоοօ(ᴏοo)ᴏоοօ(ᴏօo)ᴏоοօ(ᴏᴏοօ)ᴏоοօ(ᴏοᴏ)ᴏоοօ(οⲟ)ᴏоοօ(օо)ᴏоοօ(οᴏᴏ)ᴏоοօ(օⲟοо)ᴏоοօ(oᴏⲟⲟ)ᴏоοօ(ooօᴏ)ᴏоοօ(oᴏoᴏ)
                                                                          %:define оoο(օᴏⲟ)&&օᴏⲟ,
                                                                        %:define oⲟο(օᴏⲟ)օᴏⲟ%:%:_,
                                               %:define ⲟоⲟ(ⲟᴏ)goto*оⲟо<:ⲟⲟоᴏ=(0xba1981154321ull>>4*ⲟⲟоᴏ&(0x91^0x9e))+(ⲟᴏ):>
    %:define ᴏօ(օᴏⲟ,...)<%int oᴏo_=((օᴏⲟ)+(0x4e -0x47))>>(0x0|0x3);switch((օᴏⲟ)&(0x2+0x5)){case(0x7a^0x7a):do<%__VA_ARGS__;case(0x2+0x5):__VA_ARGS__;case(0x2a^0x2c):\
     __VA_ARGS__;case(0x26^0xb1^0x92):__VA_ARGS__;case(0x3+0x1):__VA_ARGS__;case(0x5a-0x57):__VA_ARGS__;case(0x2+0x0):__VA_ARGS__;case(0x9d-0x9c):__VA_ARGS__;%>while(--\
                                                                             oᴏo_>(0xbd-0xbd));}%>
                                                                  %:define օoⲟօ ᴏᴏοᴏ.ⲟᴏοο[(0xb05+0x681):>
                             %:define ᴏо (օoⲟօ^=օoⲟօ<<(0x8|0x5),օoⲟօ^=օoⲟօ>>(0x49^0xe2^0xba),օoⲟօ^=օoⲟօ<<(0x30-0x2b),(օoⲟօ>>8)*5.9604645e-8f)
                                                                      %:define оο(оօ)(оօ)<:ᴏᴏοᴏ.οoⲟо]
                                                               %:define οⲟᴏ(оօ)(оօ)<:ᴏᴏοᴏ.οoⲟо+(0x2d4-0x7c)]
                                                               %:define օο(оօ)(оօ)<:ᴏᴏοᴏ.οoⲟо+(0x453^0xe3):>
                                                              %:define oᴏօ(оօ)(оօ)[ᴏᴏοᴏ.οoⲟо+(0x600|0x108):>
                                                               %:define օoо(оօ)(оօ)[ᴏᴏοᴏ.οoⲟо+(0x900|0x60)]
                                                              %:define ᴏᴏᴏ(оօ)(оօ)<:ᴏᴏοᴏ.οoⲟо+(0x1ac+0x7d8)]
                                                              %:define οᴏоо(оօ)(оօ)<:ᴏᴏοᴏ.οoⲟо+(0xd00|0x85)]
                                                             %:define օօⲟ(оօ)(оօ)<:ᴏᴏοᴏ.ⲟοо+(0x2eb7+0x1769):>
                                                              %:define ᴏοօ(оօ)(оօ)<:ᴏᴏοᴏ.ⲟοо+(0x6d400>>0x4):>
                                                              %:define оⲟօо(оօ)(оօ)<:ᴏᴏοᴏ.ⲟοо+(0x6e45-0xe5)]
%:define ⲟᴏᴏ оο(ooⲟ)+=օο(ooⲟ),οⲟᴏ(ooⲟ)+=oᴏօ(ooⲟ),оο(ooⲟ)+=(0x320>>0x2)*((оο(ooⲟ)<(0xbf^0xbf))-(оο(ooⲟ)>=(0xc80>>0x4))),οⲟᴏ(ooⲟ)+=(0x190>>0x2)*((οⲟᴏ(ooⲟ)<(0xb4-0xb4))-(οⲟᴏ\
                                                                          (ooⲟ)>=(0x24|0x40))),ooⲟ++
 %:define оᴏօο оօ=օօⲟ(ooⲟ),оօ?(оⲟօо(οօοо++)=ᴏοօ(12),оⲟօо(οօοо++)=ᴏοօ((0xc+0x1)),оⲟօо(οօοо++)=ᴏοօ((0x0|0xe)),оⲟօо(οօοо++)=(0x0|0x30)+оօ,оⲟօо(οօοо++)=ᴏοօ(15),оⲟօо(οօοо++)=\
    ᴏοօ((0x40>>0x2)+оօ)):(оⲟօо(οօοо++)=ᴏοօ((0x4*0x4))),ooⲟ++%(0x320>>0x2)==199&&(оⲟօо(οօοо++)=ᴏοօ((0x25^0x2f^0xd)),оⲟօо(οօοо++)=ᴏοօ((0x3+0x5)),оⲟօо(οօοо++)=ᴏοօ((0xd9-0xd0\
                                                       )),оⲟօо(οօοо++)=ᴏοօ((0x3f^0x35)),оⲟօо(οօοо++)=ᴏοօ((0x16>>0x1))),0

                                                                                         long
                                                                       օⲟօ(             int,        const
                                                                      void*,           unsigned   long)/**/    __asm__(
                                                                     "write")  ;int      оⲟο(     const char *)__asm__(/**/       "atoi");int
                                                                օᴏo(  /*ᴏо*/  unsigned)           __asm__(  "usleep");union     <%/**/    float
                                                              οoⲟо<:         22250];                /*o*/   unsigned ⲟᴏοο[(    /**/          /**/
                                      0x5703-                0x19)];          char ⲟοо                      <:(0x1591e +/**/  /**/    /**/    /**/     0x28a):>
                                     ;}ᴏᴏοᴏ;         /**/    const char        ᴏoο<:]      =/*ᴏ*/            "\x3a\x68"/**/   /**/    /*о*/   /**/   "\x3c\x65"
                                      /*oоօ*/    "\x7d\x2d"   /*ooօо*/                   "\x33\x03"            "\x19\x0b"     /**/            /**/  "\x3a\x09"/**/
                           "\x64\x3c"           /*о*/    /*օ*/         "\xeb\xd4"        "\xdc\xd7"                            /*o*/         /**/   "\xda\xa7"/**/
                         "\xc6\xd7"/*օ*/       /**/        /**/     "\xbd";const/*օ*/    unsigned                               short    οօ<:]={     (0x11a+0x2e6)
                        ,(0x4+0x20),(/**/      /**/        /**/   0x245^0x1a^0x7),(      0x61^0x30^        0x46),         (       0x8e^0x8f),         600};void             ⲟօоo(
                       int օᴏⲟ)<%%>void        ⲟօоᴏ        (int  oᴏо,int օᴏⲟ)<%}void       oօᴏ(int        );void       οⲟο(int);                        void              ⲟoᴏ(int);
                      void ⲟⲟᴏ(int);void        ᴏⲟ(int);void     οoо(int,int);void(*/**/                 const օoᴏ    <::>)(int)=          <%oօᴏ,                        οⲟο,ⲟoᴏ,ⲟⲟᴏ,
                      ⲟօоo,ᴏⲟ%>;void(*/**/        const օօᴏᴏ    <::>)(int,int)=<%ⲟօоᴏ,          οoо%>;    float оо(   float ооᴏ){        union<%                         float οoⲟо;
               /*o*/   unsigned ⲟᴏοο;%>ᴏᴏ;                      float օᴏօ=ооᴏ*.5f;ᴏᴏ.         οoⲟо=ооᴏ;    ᴏᴏ.        ⲟᴏοο=/*օоօ*/      0x5f375a86u-        (ᴏᴏ.ⲟᴏοο      >>(0x10>>
              0x4));    ᴏᴏ.οoⲟо=ᴏᴏ.οoⲟо*(           1.5f-օᴏօ*    ᴏᴏ.οoⲟо*ᴏᴏ.οoⲟо);return      ᴏᴏ.οoⲟо=ᴏᴏ                .οoⲟо*(         1.5f-օᴏօ*ᴏᴏ.    οoⲟо*ᴏᴏ.οoⲟо);%>   void oօᴏ
      (int    օᴏⲟ)<%      float οoᴏ=(             օᴏⲟ+.5f)*.25f   ,ᴏᴏ=оо(οoᴏ),οᴏo=οoᴏ*         ᴏᴏ*.0625f   ;int                          oᴏo=οᴏo<      .3f;ᴏᴏᴏ(օᴏⲟ)=oᴏo*((
     οᴏo*/**/  /*օ*/         /*оᴏо*/             3.3333333f-(      0x60^0x7b^0x1a))*ᴏᴏ           );     οᴏоо(օᴏⲟ)=!                       oᴏo*(((-   6.122449f*οᴏo+/*оᴏⲟⲟ*/      /*ο*/
      /*ooⲟ*/                                   7.959184f)*οᴏo-      1.836735f)*ᴏᴏ);    }void οⲟο     (int օᴏⲟ)<%օoо(                                օᴏⲟ)=(signed char)(/**/   /*ⲟօоοо*/    /*оo*/
                               /*ᴏⲟᴏօ*/         0x1E9C6400u>>8*(         0x807>>      (        0x83  -0x81)*((օᴏⲟ%(0xde^     0x10         ^         0xc8)-օᴏⲟ/(0x6|0x0)+(0x1   ^0xc3^0xc4 ))%(0x0+
              0x6))&(        0x83    ^           0x80)))/100.f+(    ᴏо*               .3f       -    .15f);}void ⲟoᴏ(int  օᴏⲟ){оο(     օᴏⲟ)=ᴏо*(    0xc8|0x0);οⲟᴏ(օᴏⲟ)=ᴏо*(    0x12+0x52 );%>void ⲟⲟᴏ
           (int օᴏⲟ){       ᴏοօ       (օᴏⲟ        )=օᴏⲟ<:ᴏoο]^   (օᴏⲟ*(0x3|           0x4       )+(  0xa0-0x7f))^ᴏοօ(օᴏⲟ- (0x4>>0x2)  );}void ᴏⲟ(    int օᴏⲟ)<%int ᴏᴏо=(int)    (οⲟᴏ(    օᴏⲟ)/(0x2+
          0x0))%(0x41-0xf   ),         ооᴏ           =(int)    оο(օᴏⲟ)%(0x8|          0xc0     );    օօⲟ(ᴏᴏо*(0x4*0x32)+  ооᴏ)=օᴏⲟ%  (0xe9^0xef)+    (0x0+0x1);%>void οoо(                int oᴏо,
         int օᴏⲟ)<%int      ᴏоo=      օᴏⲟ                      +(0x0+0x1)==             oᴏо<:οօ:>     ;օoᴏ<:oᴏо:>(օᴏⲟ);    օօᴏᴏ<:!    (0x50>>(oᴏо     +ᴏоo)&(0x10>>0x4))](    oᴏо+ᴏоo      ,ᴏоo?(
         0x0|0x0):օᴏⲟ+(       0x88^0x89)     );}int            main(int оⲟ,                            char**ⲟⲟо){/**/                 static           void*оⲟо<:]=<%      ⲟᴏοⲟ(оoο)%>
          ;enum<%ⲟᴏοⲟ(oⲟο       )%>;      unsigned/**/          long long         ⲟοо=0;                  float οⲟօ=            (0x94^                     0x94),oᴏ=(      0x0>>0x4),ооᴏ
           ,ᴏᴏо,ⲟᴏοο;int                 оօ,οօοо,ooⲟ,            ⲟⲟоᴏ=0,οοⲟ     =(0x0+0x0);                                  goto*оⲟо<:            ⲟⲟоᴏ:>;                οօᴏ:օoⲟօ=(оⲟ>(
    0x47-    0x45)?оⲟο   (ⲟⲟо<:(0x2     |0x0)]):(0x39^                        0x3e))*/*оօⲟօ*/                    /*օ*/      2654435761u|(        0x21^0x20);               ᴏᴏοᴏ.ⲟᴏοο<:(
   0x7*0x281            ):>=   оⲟ>(     0xaa^0xa9)?оⲟο(                       ⲟⲟо<:(0x2+0x1):>                ):(0x7561^    0x51);оⲟ=оⲟ>(       0x1|0x0)?оⲟο(   ⲟⲟо[1])     :(0x17^0x17
  );οoо(0,(            0x0        >>     0x3));օⲟօ((0xe9            ^0xee     ^0x6),ᴏᴏοᴏ.ⲟοо+(               0x6d92^0xd1)   ,(0x0|0x4));       օoⲟօ=ᴏᴏοᴏ.ⲟᴏοο  [(0x461c>>     0x2):>;
   ⲟоⲟ((0x0+   0x0    ));          ᴏοo    :оօ=ⲟοо/600%(           0x12c0>>    0x3);οօοо=ⲟοо%(   0x3*0xc8     );οօοо||(οⲟօ   =oᴏ=(0x0|0x0));     ооᴏ=оο(οօοо)-  оο(оօ);ᴏᴏо                =οⲟᴏ(
     οօοо)   -οⲟᴏ(оօ   );         ⲟоⲟ(      (0x8a^               0x8a));ᴏօo:   ооᴏ-=(0x77+     0x51)*((       ооᴏ*.005f+     12582912.f)-        12582912.f)   ;ᴏᴏо-=(     0x640>>      0x4)*((
            ᴏᴏо*.01f   +/**/     /**/                            12582912.f)-     /*ᴏοⲟօ*/     12582912.f      );ⲟоⲟ(0)        ;ᴏᴏοօ:              ⲟᴏοο=         ооᴏ*   ооᴏ+ᴏᴏо*ᴏᴏо;    ooⲟ=ⲟᴏοο*(
             0xaa-       0xa6);ooⲟ-=    (0xd5          +0x32b);  ooⲟ=1024+(                     ooⲟ&ooⲟ                                                                >>(        0x9+  0x16));
                            οοⲟ      ^=(ooⲟ&(0x0      +0x0))|(     οօοо&(   0x97^                             0x97))                                        ;ⲟоⲟ(     (0x0   +     0x0    ));
                                    ᴏοᴏ:              ⲟᴏοο=ᴏᴏᴏ(            ooⲟ)+օoо(                        оօ%(0x2+                    0x4)*6+           οօοо%6)*          οᴏоо   (
                      ooⲟ);(ooⲟ     *         ooⲟ+     ooⲟ&(0x0            +0x1))&&(     оο(                (0x0|0x0))               =0);ⲟоⲟ((0x6d-      0x6d));οⲟ:    οⲟօ        +=
                     ооᴏ*ⲟᴏοο;oᴏ    +=        ᴏᴏо*                          ⲟᴏοο;ⲟοо  ++;ⲟоⲟ((              οօοо==(                0x229^0x8^0x76))*(     օо_-ᴏοo_)     );օо:   օο(оօ
                    )=օο(оօ)*        .85f   +οⲟօ* .05f;                       oᴏօ(  оօ)=     oᴏօ(             оօ)*     .85f       +oᴏ*.05f;ⲟоⲟ((оօ==(      0x2de^         0x5a^0xd3
                    ))*(οᴏᴏ_-         ᴏοo_));    οᴏᴏ:ooⲟ=0                          ;ᴏօ        ((                    0x3*0xc7    ),ⲟᴏᴏ)ᴏօ((0x0|0x3),ⲟᴏᴏ)              ⲟоⲟ(
                      (0x6f^                     0x21^0x4e                          ));       օⲟοо   :ooⲟ=(0x0|     0x0);ᴏօ((    0x7*0x595),օօⲟ(ooⲟ++)=(            0x4a^
                                0x4a))(          void)((     0xe9^0x16               ^       0xff   )&&(оο(ooⲟ)+=   օο(ooⲟ)));   οoо((0x5+0x0),0);ⲟоⲟ((      0xeb^  0xeb));
                               oᴏⲟⲟ:                       οօοо=(0xb9^                0xfb^0x42)   ;ooⲟ=0;ᴏօ((0x9c    -0x99),    оⲟօо(οօοо)=ᴏοօ(οօοо),      οօοо++)  ᴏօ((
                                0x1771+       0xf9c)      ,          оᴏօο       )ᴏօ((              0xf9^0x3c^0xc6),               оᴏօο)օⲟօ((0xe9-0xe8),     ᴏᴏοᴏ.
                                             ⲟοо+(       /**/                0x6dfa^0x9a           ),οօοо);օᴏo(         օoⲟօ);     ⲟоⲟ((оⲟ&&ⲟοо/(0xc*        /*ο*/
                                             0x7530)      >=          оⲟ)   *(       /**/   ooօᴏ_-  ᴏοo_));ooօᴏ:       return(0x0    >>0x4);oᴏoᴏ:for(
                                               ooⲟ=       0;ooⲟ     <600;  ooⲟ        ++) оο(ooⲟ)=   οⲟᴏ(ooⲟ)*(       float)ⲟοо+օο       (ooⲟ)/οοⲟ
                                                           ;return(0x51     ^             0x50);%>                    /*ᴏοᴏօоⲟօᴏⲟo
                                                              ⲟᴏοoⲟοᴏ       οoᴏօⲟ   οοⲟоо оοoⲟoоⲟᴏo                    օоⲟⲟօⲟoօоο
                                                                              ⲟоⲟⲟοoᴏᴏⲟ     ooⲟοօο                        ⲟᴏо*/
